#davaleba1
#for ციკლის მეშვეობით გამოიტანეთ რიცხვები 10-ის ჩათვლით
for i in range(11):
    print(i)

#davaleba2
#while ციკლის მეშვეობით გამოიტანეთ რიცხვები 5-დან 20-მდე.
i=5
while i<24:
     print(i)
     i=i+1

#davaleba3
#კომენტარების სახით ახსენით რა არის conditional statement, რა დანიშნლება გააჩნიათ და როგორი სახის განცხადებები გვაქვს.
#conditional statement-->არის პირობითი განცხადებები
#დანიშნულება-->გადაწყვეტილების მიღება პროგრამაში
#სახეები--> if, else

#davaleba4
#მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ თუ ასაკი იქნება მეტი ან ტოლი 18-ის მაშინ გამოუტანოს რომ იგი ზრდასრულია, ხოლო თუ იქნება 18-ზე ნაკლები საბოლოო გზის მეშვეობით გამოუტანეთ რომ ის მოზარდია.
age=input("enter your age")
if age>18:
     print("you are adult")
else:
     print("you are under 18,so you are teenager")

