#davaleba1
#შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით
nam=[1,2,3,4,5,6,7,8,9,10]
print(nam[5:])

#davaleba2
#შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ ყაროფიტითი ინდექსებით
nam=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(nam[:-9])

#davaleba3
#შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი
number= int(input("შეიყვანე რიცხვი: "))
arr = [1,2,3,4,5,6,7,8,9,10,11,12]
print(arr[2:number])
    