#davaleba1
#შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით
nam=[1,2,3,4,5,6,7,8,9,10]
print(nam[4:9])

#davaleba2
#შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ ყაროფიტითი ინდექსებით
nam=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(nam[:11])

#davaleba3
#შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი
numbers = [1,2,3,4,5,6,7,8,9,10,11,12]
n = int(input("შეიყვანე რიცხვი: "))
for i in range(1, n):
    print(numbers[i])
    