#დავალება1
#შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
# --> გამოიტანეთ პირველი 5 ელემენტი
# --> გამოიტანეთ ბოლო 3 ელემენტი
# --> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით
arr=[1,2,3,4,5,6,7,8,9,10]
print(arr[:6])
print(arr[7:])
print(arr[3:8])


#davaleba2
# შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
# --> გამოიტანეთ პირველი 6 ელემენტი
# --> გამოიტანეთ ბოლო 10 ელემენტი
# --> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)
arr=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15 ]
print(arr[:-9])
print(arr[-10:])
print(arr[-9:-1])

#avaleba3
# მოცემულია სიტვა 'თვითმფრინავი'
# გამოიტანეთ 'ნავი'
name='თვითმფრინავი'
print(name[8:])

#davaleba4
# მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
# --> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით
word='Programmer'
print(word[0:3])
print(word[-10:-7])

#davaleba5
# შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
# --> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
# --> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)
week=["ორშაბათი","სამშაბათი","ოთხშაბათი","ხუთშაბათი","პარასკები","შაბათი","კვირა"]
print(week[0:5])
print(week[-7:-2])

print(week[5:])
print(week[-2:])

#davaleba6
# მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
# გამოიტანეთ: 
# 'Python'
# 'slicing'
# 'powerful'
# გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსინგი
arr='Python slicing is very powerful'
print(arr[0:6])
print(arr[-31:-24])

print(arr[7:14])
print(arr[-24:-16])

print(arr[23:31])
print(arr[-8:-1])
