#გაკვეთილი00/level00

1.from turtle import*-ამით უნდა გავხსნათ  turtle ბიბლიოთეკა,ანუ პირველი უნდა დავწეროთ ეს და შემდეგ სხვა
კოდები.#(როცა ამ კონკრეტულ ბიბლიოთეკაშ ვმუშაობთ)
2.forward-წინ
3.exit on click-გამოირთოს მაუსზე დაჭერისას
4.left-მარცხენა
5.right-მარჯვენა
6.speed-სიჩქარე
7.color-ფერი
8.width-სიგანე
9.begin fill-დაიწყოს გაფერადება
10.end fill-დაასრულოს გაფერადება
11.penup-კალმის აღება გადააადგილება
12.goto-საით წავიდეს კალამი
13.pendown-კალმის დასმა დადება 




#level01/გაკვეთილი1

1.parantheses-ფრჩხილები
2.quotation marks-ბრჭყალები"
3.variables-ცვლადი(კონტეინერი,ყუთი)
4.value-მნიშვნელობა
5.equal sign-ტოლობის ნიშანი


