#davaleba1
#1) შემოაყვანიეთ მომხმარებელს რაღაცა სიტყვა:
# -> შეამოწმეთ არის თუ არა 'a' ან 'A' ამ სიტყვაში/ტექსტში
# -> შეამოწმეთ თუ არ არის სიტყვა 'car' ამ სიტყვაში/ტექსტში
text=input()
if "a" in text or "A" in text:
    print("ტექსტი შეიცავს  a  ასოს")
else:
    print("ტექსტი არ შიცავს a ასოს")

if "car" not in text:
    print("ტექსტი შეიცავს არ არის car")
else:
    ("ტექსტი შეიცავს არის car")


#davaleba2
#მომხმარებელს შემოატანინეთ ტექსტი.
# -> დაუარეთ ამ ტექტის ასოებს for ლუპით
# -> თუ ასო არის 'a' ან 'A' დასკიპეთ, სხვა შემთხვევაში დაპრინტეთ ასო
text = input("შეიყვანეთ ტექსტი: ")

for i in text:
    print(i)
    
text = input("შეიყვანეთ ტექსტი: ")

for i in text:
    if i == 'a' or i == 'A':
        continue
    print(i)
    