#ჩვენ ვისწავლეთ ოთხი მონაცემთა ტიპი-data type ესენია 1.string 2.integer 3.float 4.boolean\

 #string-ტექსტი რომელიც მოცემული გვაქვს ბრჭყალებში მაგ: "ნუცა"  "გაკვეთილი"
#integer_ინტეჯერი არის მთელი რიცხვები მაგ:10 25 50  #float-არის ათწილადი რიცხვები მაგ1.5; 5.8; 9.5
#boolean(ბულიონ)-ბულეანს აქვს მხოლოდ ორი მნიშვნელონა  true და  false

print("nuca")
print(100)
print(0.5)

#ცვლადი არის კონტეინერი ყუთი რომელსაც ჰქვია სახელი მასში მოთავსებული მონაცემთა ტიპის მიხედვით მაგ:
name="nuca"  

name="nuca"
age=15
height=1.60
country="saqartvelo"
car="mercedes"
