#davaleba1
#კომენტარის სახით ახსენით თუ რა არის index და რაში ვიყენებთ მას
#პითონში სიის ელემენტებს აქვთ თავიაანთი მისამართი და ამ მისამართებს ეწოდება ინდექსი

#დავალება2
#შექმენით ცვლადი სადაც შეინახავთ ამ სიას [4,6,1,5,9,8,4] ,თქვენი დავალებაა რომ მიწვდეთ ამ სიაში ელემენტებს ინდექსინგის გამოყენებით ,შეკრიბეთ ორი რიცხვი რომ მიიღთ შემდეგი რიცხვები --> 10 , 2 , 14 , 20 , 4 , 7 , 27 , გამოიყენეთ მათემატიკური ოპერატოები
num=[4,6,1,5,9,8,4]
print(num[0]+num[1])
print(num[2]+num[2])
print(num[4]+num[3])
print(num[4]+num[1]+num[3])
print(num[0])
print(num[1]+num[2])
print(num[0]+num[1]+num[4]+num[5])

#davaleba3
#შექმენით სია სადაც შეიყვანთ ადამიანის სახელებს,უნდა გქონდეთ სულ 10 სახელი,თქვენი დავალებაა რომ გამოიტანოტ ,მე 5 , მე 9 ,მე 3 ,მე 7 და პირველ ინდექსზე მდგომი ელემენტები ცალ ცალკე,გამოიყენეთ ინდექსინგი
name=["nika","luka" ,"mari","nini" ,"goga","giga ","taso" ,"ana" ,"gio" ,"lizi"]
print(name[4])
print(name[8])
print(name[2])
print(name[6])
print(name[0])

#davaleba4
#შექმენით სია სადაც მოათავსებთ სტრინგ ტიპის მონაცემებს,თქვენი დავალებაა გომ for loop და while loop (ორივე) ს დახმარებით გამოიტანოთ თთოეული ელემენტი ცალ ცალკე
box=["vashli","atami","nia","aleqsandre","mari","ani","goga"]
for i in range(0,7):
    print(box[i])

i=0
while i<0:
    print(box[i])
    i-i+1

#davalba5
#შექმენით სია სადაც შეინახავთ 7 ცალ ელემენტს(მონაცემის ტიპს არ აქვს მნიშვნელობა),თქვენი დავალებაა რომ ამ სიაში შეცვალოთ მე 3 ინდექსზე დმგომი ელემენტი და ჩაანაცვლო "vashli" ით, ასევე შეცვალე მე 6 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე 'msxali' ით ,ასევე შეცვალე მე 4 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე ის 'atami" ით,გამოიტანე საბოლოო სია ტერმინალში,სადაც ეს სალი ელემენტი იქნება განახლებული~
box=["vaso","barbare","nia","aleqsandre","mari","ani","goga"]
box[2]="vashli"
box[5]="msxali"
box[3]="atami"
print(box)

#davaleba6
#იპოვეთ საბოლოო პასუხი--> True and False or False and True or false and false or true ---> ...
#True and False or False and True --or ---false and false or true
#true and false=false
#false and true=false
#True and False or False and True=False

#false and false=false
#false or true=true
#false and false or true=true

#True and False or False and True=False   or    false and false or true=true
#false or true=true

#pasuxia "true"


#davaleba7
#შექმენით სია სადაც მოთავსებული გექნებათ ცხოველების სახელები, თქვენი დავალებაა რომ -->  თუ ამ სიაში მოთავსებული მე 3 ინდექსზე მდგომი ელემენტი არის ლომი მაშნ დაპრინტე --> "there is lion on index 3" სხვა შემთხვევაში დაუპრინტე რომ --> "there is no lion on index 3"
animals=["dog","elephand","cat","lion","tiger"]

if animals[2]=="lion":
    print("there is lion on index 3")
else:
    print("there is no lion on index 3")

#davaleba8
#basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

# დაბეჭდეთ კალათის პირველი ხილი.

# დაბეჭდეთ კალათის მესამე ხილი.

# შეცვალეთ მეორე ხილი "ბანანი" სხვა ხილით (თქვენი არჩევანით).

# დაბეჭდეთ თავიდან ბოლომდე ყველა ხილი ცალ–ცალკე, ინდექსების გამოყენებით (არა for-ით).
basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]
print(basket[0])
print(basket[2])
basket[1]="მარწყვი"
print(basket[0])
print(basket[1])
print(basket[2])
print(basket[3])
print(basket[4])

#davaleba9
#letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

# დაბეჭდეთ მესამე ასო.

# დაბეჭდეთ მე–5 და მე–6 ასო.

# დაბეჭდეთ ბოლო ასო.

# ააწყეთ სიტყვა "მამა" ინდექსებით (ყველა ასო ინდექსით უნდა აიღონ და შეაერთონ).

# ააწყეთ სიტყვა "გოლა".

# ააწყვეთ სიტყვა "გოგა"
letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]
print(letters[2])

print(letters[4])
print(letters[5])

print(letters[9])

print(letters[6]+letters[0]+letters[6]+letters[5])

print(letters[2]+letters[3]+letters[4]+letters[0])

print(letters[2]+letters[3]+letters[2]+letters[0])

#davalebs10
# letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

# აიღეთ მე–4 ინდექსზე არსებული ასო და შეინახე ცვლადში

# თუ ეს ასო არის "ლ", დაბეჭდეთ: "სწორია! ასო ლ ა"

# სხვა შემთხვევაში დაბეჭდეთ: "არასწორია, სცადე თავიდან"

# =========================
# აიღეთ ბოლო ასო და შეინახე ცვლადში

# თუ ეს "ე"–ა, დაბეჭდეთ "საიდუმლო სიტყვა იწყება სწორად".

# სხვა შემთხვევაში – "საიდუმლო სიტყვა არასწორია".
# ==========================

# ააწყვეთ სიტყვა "გელა" და შეინახე ცვლადში 

# თუ ცვლადში შენახული სიტყვა "გელა"–ს ტოლია, დაბეჭდეთ "გაარტყი სახელი!"

# სხვა შემთხვევაში – "შტერი ხარ!დ".

letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]
name1=letters[3]
if name1=="ლ":
    print("სწორია! ასო ლ ა")
else:
    print("არასწორია, სცადე თავიდან")

name2=letters[9]
if name2=="ე":
    print("საიდუმლო სიტყვა იწყება სწორად")
else:
    print("საიდუმლო სიტყვა არასწორია")

word=(letters[2]+letters[9]+letters[4]+letters[0])
if word=="გელა":
    print("გაარტყი სახელი!")
else:
    print("შტერი ხარ!დ")

#davaleba11
#შექმენი სია რომელიც იქნება სტრინგებით სავსე,შენი დავალებაა რომ მომხმარებელს შემოატანინო რაიმე რიცხვი,შენი დავალებაა რომ ამ სიიდან გამოიტანო მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი
words = ["dog", "cat", "lion", "tiger", "elephant"]
index = int(input("შეიყვანე ინდექსი (0-დან 4-მდე): "))
print("ამ ინდექსზე მდგომი ელემენტია:", words[index])










