#davaleba1
#მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით
user=input("enter your name:")
print(user.upper())

#davaleba2
#მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით
name=input("შეიყვანე შენი სახელი დიდი ასოებით:")
print(name.lower())

#davaleba3
#მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი
name=input("შეიყვანე შენი სახელი პატარა ასოებით:")
print(name.capitalize())

#davaleba4
#შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით
list=["giorgi","vaso","mariami","nino"]
for i in range(4):
    print(i.upper())

#davaleba5
#შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით
list=["nan","goga","giorgi","nino","anmaria"]
for i in range(5):
    print(i.lower())

#davaleba6
#შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს
list=["nan","goga","giorgi","nino","anmaria","jorji"]
for i in range(6):
    print(i.capitalize())

#davaleba7
#7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს
list=[345,7536753,435,356,3678,93436,37635]
print(len[list])

#davaleba8
#შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს
name="ალექსანდრე"
print(len(name))

#davaleba9
#შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა
numbers=[345,567,356,7928,536,2683,9207]
even_count=0
for i in numbers:
    if i%2==0:
      even_count+=1
print(even_count)

#davaleba10
#შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა
numbers=[345,879,355,3782,5723,3768]
odd_count=0
for i in numbers:
    if i%2==1:
      odd_count+=1
print(odd_count)

#davaleba11
#მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები
start=int(input("enter number:"))
end=int(input("enter number:"))
step=int(input("enter number:"))
for i in range(start,end,step):
   if i%2==0:
      print(i)
      
