#davaleba1
#მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
#--> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'
number=float(input("enter your number:"))
if number>0:
    print("ეს რიცხვი დადებითი რიცხვია")
elif number<0:
    print("ეს რიცხვი უარყოფითი რიცხვია")
else:
    print("ეს რიცხვი ნულია")


#დავალება2
#მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'
age=int(input("enter your age:"))
if age>0 and age <=12:
    print("ბავშვი ხარ")
elif age>13 and age<=19:
    print("მოზარდი/თინეიჯერი ხარ")
elif age>20 and age<=64:
    print("ზრდასრული ხართ")
elif age>65 and age<=120:
    print("ხანში შესული ხართ")
elif age>120:
    print("გურუ ან ჯადოქარი")
elif age<0:
    print("არასწორი ინფო")
 


#davaleba3
#დაწერეთ "password guesser" პროგრამა, შექმენით რაიმე ცვლადი და მასში შეინახეთ ის პაროლი რომელსაც ყველგან იყენებთ ;)
# მომხმარებელს მოთხოვეთ გამოიცნოს თქვენი პაროლი
# აღნიშნეთ ცდების რაოდენობა
# გამოიყენეთ while loop, მანამ ატრიალეთ სანამ მომხმარებელი პაროლს არ გამოიცნობს ან დაწერს --> 'nah strong password'
# ბოლოს აჩვენეთ(დაუპრინტეთ) რამდენი ცდა დაჭირდა პაროლის გამოსაცნობად
password="mysecret123"
tries=0
guess=input("gamoicani chemi paroli: ")
while password!=guess and guess!="jadosnuri sityva" :
    print("ver gamoicani")
    tries=tries+1
    guess=input("gamoicani chemi paroli: ")
print("tries: ",tries)

    

#დავალება4
#მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი
num1 = float(input("შეიყვანე პირველი რიცხვი: "))
num2 = float(input("შეიყვანე მეორე რიცხვი: "))
num3 = float(input("შეიყვანე მესამე რიცხვი: "))

if num1>num2 and num1>num3:
    print("udidesi ricxvi: ",num1)
if num2>num1 and num2>num3:
    print("udidesi ricxvi",num2)
if num3>num1 and num3>num2:
    print("udidesi ricxvi",num3)



#დავალება5
#შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'
day=int(input("შეიყვანე რიცხვი 1-დან 7-ჩათვლით:"))
if day==1:
    print("ორშაბათი")
elif day == 2:
    print("სამშაბათი")
elif day == 3:
    print("ოთხშაბათი")
elif day == 4:
    print("ხუთშაბათი")
elif day == 5:
    print("პარასკევი")
elif day == 6:
    print("შაბათი")
elif day == 7:
    print("კვირა")
else:
    print("არ ვიცი ეგ რა დღეა")


