#davaleba 1
# #მომხმარებელს შემოატანინეთ ორი რიცხვი,შეადარეთ ეს ორი რიცხვი ერთმანეთს(გამოიყენეთ შედარების ოპერატორები(>, <, ==)
num1=int(input("enter your age"))
num2=int(input("enter your age"))
print(num1<num2) #true
print(num1>num2) #false
print(num1==num2) #false

#davaleba 1
#შექმენით 5 ცვლადი,3 ცვლადში შეინახეთ რიცხვები რომლებიც იქნებაინ სტრინგის ტიპის,დანარჩენ 2 ცვლადში შეინახეთ ჩვეულებრიბი ინტეჯერები,შენი დავალებაა იპოვო ამ ხუთი რიცხვის ნამრავლი,შემდეგ ეს ნამრავლი გაყავი რიცხვების რაოდენობაზე და დაპრინტე საბოლოო შედეგი,გამოიყენე შეაბამისი ფუნქცია რომ გადააქციო სტრინგი რიცხვები ინტეჯერად
num1="10"
num2="30"
num3="70"
num4=22
num5=77
print((int(num1)+int(num2)+int(num3)+num4+num5)/5)

#davaleba3 
#მომხმარებელს შემოატანინეთ სამი სტრინგ ტიპის მნიშვნელობა ასევე შემოატანინეთ ერთი ინტეჯერი,თქენი დავალებაა მომხმარებლის მიერ შემოყვანილ სამ სტრინგზე მოახდინოთ კონკატინაცია და შეინახოთ ცალკე ცვლადში ეს სამი გადაბმული სტრინგი,კონკატინაციის შემდეგ კი გაამრავლეთეს ეს მთლიანი სტრინგი მომხმარებლის მიერ შემოყვანილ რიცხვზე
num1=input("enter your age")
num1=input("enter your age")
num3=input("enter your age")
num4=int(input("enter your age"))
print(num1+num2+num3)
num123="xutiatiocdaati"
print(num123*num4)

#davaleba4 
#კომენტარის სახით ახსენით თუ რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომელი ოპერატორის დროს რას უფრო ენიჭება უპირატესობა(True , False) და რატომ
#ჩვენ ვისწავლეთ logical operators_ლოგიკური ოპერატორები,and _ or 
#and_ოპერატორის გამოყენების დროს უპირატესობა ენიჭება false.თუ რომელიმე პირონა არის false მაშინ შედეგიც აუცილებლად იქნება false.
#or_ოპერატორის გამოყენების დროს  უპირატესობა ენიჭება True.თუ რომელიმე პირობა არის True მაშინ შედეგიც აუცილებლად იქნება True.

#დავალება 5
#გვერდით მიუწერეთ რას გამოიტანს შემეგი ოპერაციები
#კომენტარის სახით მკიუწერეთ ასევე გვერდით თუ რატომ იქნება თქვენს მიერ შერჩეული პასუხი სწორი
  #   (and)                             
True and True #-true-რადგან არ გვაქვა  False პირობა.            
True and False #false-რადგან გვაქვა False პირობა.   
False and True #false- რადგან გვაქვა False პირობა.    
False and False #false-რადგან გვაქვა False პირობა. 
  #   (or)
True or True #  True_რადგან მოცემული გვაქვა  True პირობა       
True or False #  True რადგან მოცემული გვაქვა  True პირობა  
False or True # True რადგან მოცემული გვაქვა  True პირობა  
False or False #false რადგან არ გვაქვა მოცემული True პირობა

#დავალება6
#მოიყვანე მაგალითები and და or ოპერატორებზე,დაპრინტე და გაუშვით ტერმინალში და ნახეთ შედეგი
#    (and)
print(True and True) #-->True
print(True and False) #-->False
print(False and False) #--.false
#     (or)
print(True or False) #-->True 
print(True or True) #-->True
print(False or False) #-->False

#davaleba 7
#შექმენი 4 ცვლადი სადაც შეინახავთ სხვადასხვა მონაცემთა ტიპებს და შენი დავალებაა რომ გაიგო ამ ცვლადებში შენახული მონაცემების ტიპები(გამოიყენეთ შესაბამისი ფუნქცია)
name="mari"
age=34
height=1.90
real=False
print(type(name))
print(type(age))
print(type(height))
print(type(real))

#davaleba 8
#მომხმარებელს შემოატანინე 3 მნიშნველობა,ერთის ტიპი იყოს float ერთის integer ერთის string და დაპრინტეთ ისინი(გამოიყენეთ შესაბამისი ფუნქციები რომ შემოყვანილ მნიშვნელობებს ქონდეთ შესაბამისი ტიპი(note:მომხმარებელს რომ შემოყავს მნიშვნელობა თავიდან ყოველთვის არის სტრინგი),თუ ფლოათსშემოიყვანს მომხმარებელი გახადეთ ინფუთი floaT ტიპის თუ ინტეჯერს შემოიყვანს გახადეთ ინფუთი ინტეჯერ ტიპის
name=input("enter your name")
age=int(input("enter your age"))
height=float(input("enter your height"))
print(name)
print(age)
print(height)
