#davaleba 1
#კომენტარის სახით ახსენი თუ რომელი ოპერატორები ვისწავლეთ და რა დანიშნულება აქვთ მათ
#ჩვენ დღეს ვისწავლეთ შდარების ოპერატორები (<;>;==). შედარების ოპერატორები გვაძლევენ boolean ტიპის პასუხს
# მაგ: 10>5               15<3                14==15
#      print(10>5)        print(15<3)         print(14==15)
#      true               false               false

#davaleba 2
#მომხმარებელს შემოაყვანინეთ ორი რიცხვი,შეადარეთ თუ პირველი რიცხვი მეტია მეორეზე,ასევე შეადარე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე,და ასევე შეადარე თუ პირველი რიცხვი უდრის მეორე რიცხვს
num1=20
num2=35
print(num1<num2) #true
print(num1>num2) #false
print(num1==num2) #false

#davaleba 3
#მომხმარებელს შემოატანინეთ 5 სტრინგ ტიპის მნიშვნელობა,შენი დავალებაა მოახდინო მათი კონკატინაცია
name1="ana"
name2="mari"
name3="taso"
name4="keso" 
name5="nini"
print(name1+name2+name3+name4+name5)

#davaleba 4
#მომხმარებელს შემოატანინე 4 რიცხვი,შენი დავალებაა გაიგო ამ რიცხვების საშუალო არითმეტიკული.
num1=input("pirveli")
num2=input("meore")
num3=input("mesame")
num4=input("meotxe")

print((int(num1)+int(num2)+int(num3)+(num4))/4)
# pasuxi:2,5

#davaleba 5
#შექმენი 4 ცვლადი,ამ ცვლადებშ შეინახე 4 განსხვავებული მონაცემთა ტიპის ელემენტები და დაპრინტე მათ ტიპი(გამოიყენეთ შესაბამისი ფუნქცია)
name="nia"
age=15
height=1.90
boolean="True"

print(type(name))
print(type(age))
print(type(height))
print(type(boolean))


#davaleba 6
#შექმენი 2 ცვლადი,შეინახე ორივე ცვლადში სტრინგ ტიპის მნიშვნელობები დაშეადარე ისინი არიან თუ არა ერთნაირები(უდრის თ არა ერთმანეთს)
name1="nuca"
name2="mari"
print("nuca"=="mari") #false

#davaleba 7
#შექმენი 4 ცვლადი,სადაც გექნება მოთავსებული რიცხვები ოღონდ სტრინგის სახით მაგ: "40",გადაიყვანე ეს სტრინგი რიცხვები ინტეჯერში(გამოიყენე შესაბამისი ფუნქცია) და გაიგე ამ ოთხი რიცხვის ჯამი
num1="40"
num2="20"
num3="60"
num4="90"
print((int(num1)+int(num2)+int(num3)+int(num4))/4)

#davaleba 8
#შექმენი 3 ცვლადი,ამ ცვლადებში შეინახეთ ინტეჯერ ტიპის მონაცემები,შენი დავალებაა ეს რიცხვები გაასტრინგო(გამოიყენე შესაბამისი ფუნქცია) და გამოიტანო ეს რიცხვები ერთ წინადადებაში. მაგ:304050
num1=20
num2=40
num3=70
print(str(num1)+str(num2)+str(num3))


