#davaleba1
#მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ  ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც
#  +
print(15+55) #70
print(98+57) #155
print(45+68) #113

#  -
print(68-65) #3
print(97-68) #29
print(59-48) #11

#  /
print(56/8) #7
print(99/3) #33
print(456/5) #91.2

#  *
print(45*4) #180
print(34*2) #68
print(33*5) #165

#  //
print(34//4) #8
print(78//4) #19
print(46//6) #7

#  **
print(7**2) #49
print(3**5) #243
print(8**3) #512

#  %
print(10%6) #4
print(24%7) #3
print(56%23) #10
#----------------------------------------------------------------------------------------------------------------

#davaleba2
#კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინო
# დღეს ვისწავლეთ სამი მათემათიკური ოპერატორი ესენია://   **   %
# //-->ორი გაყოფის ნიშანი,ის პასუხად გვიბრუნებს სულ მთელ რიცხვს ანუ(ინტეჯერს) და გვიჩვენებს თუ რამდენჯერ ჯდება ეს რიცხვი გამყოფში
# **--> ორი გამრავლების ნიშანი,მას ხარისხში აჰყავს მოცემული რიცხვი
# %-->პროცენტული გაყოფა,გვინრუნებს ნაშთს როდესაც ერტ რიცხვს ვყოფთ მეორეზე
#----------------------------------------------------------------------------------------------------------------

#დავალება3
#დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ
#---------------------------------//--> ორი გაყოფა---------------------------------------------------------
print(34//23) #1
print(45//23) #1
print(88//34) #2
print(14//5) #2
print(12//7) #1
print(56//17) #3

#----------------------------------**-->ორი გამრავლება--------------------------------------------------------
print(7**3) #343
print(2**5) #32
print(4**2) #16
print(6**3) #216
print(7**5) #16807

#-----------------------------------%->პროცენტული გაყოფა-----------------------------------------------------
print(100%67) #33
print(50%45)  #5
print(90%78)  #12
print(56%34)  #22
print(356%234) #122
#----------------------------------------------------------------------------------------------------------------

#davaleba4
#ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

    #  15 / 3 = 5
    #  20 / 4 = 5
    #  100 / 20 = 5

    #  15 // 10 =1 
    #  10 // 7 =1
    #  40 // 12 = 3

    #  4 * 3 = 12
    #  40 * 3 = 120
    #  120 * 3 = 360

    #  4 ** 3 = 64
    #  10 ** 3 = 1000
    #  2 ** 6 = 64
    #  3 ** 4 = 81


    #  10 % 7 = 3
    #  3 % 2 = 1
    #  50 % 25 = 0
    #  14 % 11 = 3
    #  110 % 50 = 10
#---------------------------------------------------------------------------------------------------------------

#davaleba5
#კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან
#ცვლადებში შეგვიძლია მხოლოდ ერთი ელემენტის შნახვა,სიებში კი შეგვიძლია შვინახოდ მრავალი ელემენტი

#davaleba6
#შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები
name=["mariami","ana","barabre"]

#davaleba7
#შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები
age=[15,6,89,34]

#davaleba8
#შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები
height=[13.5, 56.78, 56.89]

#davaleba9
#შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები
what=[False,True]

#davaleba10
#შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი
chveni_sia=["mariami", 13, 160.7 ,False]

#=-------------------------Bonus-----------------------------------------------------

# davaleba11
#მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ ნახოთ შედეგი)
num1=input("enter your age:")
num2=input("enter your age:")
print(num1//num2)
print(num1**num2)
print(num1%num2)

#davaleba12
#მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი არის 30 ზე მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 and 200" , სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"
num1=input("enter your age:")
if num1>30 and num1<100:
    print("between 30 and 100")
elif num1>100 and num1<200:
    print("between 100 and 200")
else:
    print("other number")

#davaleba13
#შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)
name="nuca"
age=15
height=16.78
what=True
age=34

print(type(name))
print(type(age))
print(type(height))
print(type(what))
print(type(age))

#davaleba14
#while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...
i=50
while i<100:
    print(i)
    i=i+5

#davaleba15
#for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...
for i in range(40,90,3):
    print(i)

#davaleba16
#გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით
for i in range(15):
    print("nuca digmelashvili")

i = 1
while i < 15:
    print("Nuca Digmelashvili")
    i = i + 1

#დავალება17
#შექმენი ცვლადი სადაც შეინახავ შენს სახელს
# შექმენი ცვლადი სადაც შეინახავ შენს გვარს
# მომხმარებელს შემოატანინეთ სახელი
# თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#       მომხმარებელს შემოატანინე გვარი
#       თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#             დაპრინტე --> same name and surname
#       სხვა შემთხვევაში
#             დაპრინტე -- > same name but different surname
# სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#     დაპრინტე --> aqedan moshordi
my_name="nuca"
my_surname="digmelashvili"

user_name=input("enter your name:")
if user_name==my_name:
    user_surname=input("enter your surname:")
    if user_surname==my_surname:
        print( "same name and surname")
    else:
        print("same name but different surname")
else:
    print(" aqedan moshordi")

#davaleba18
#შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

my_password="1234"
while True:
    user_password = input("შეიყვანე პაროლი: ")
    if user_password == my_password:
        print("გამოიცანი")
        break
    else:
        print("არასწორია, სცადე თავიდან!")



    