#davaleba1
# კომენტარის სახით ჩამოწერეთ  რომელი ახალი მათემატიკური ოპერატორები ვისწავლეთ,თითოეულ მათგანს მიუწერეთ  რომელი რას აკეთებს და თითზე მოიყვანე სამ-სამი მაგალითი
#1 //-->ეს არის იგივე გაყოფის ნიშანი,ის პასუხად სულ გვიბრუნებს მთელ რიცხვს,და გვივენებს გასაყოფი რამდენჯერ ჯდება გამყოფში მაგ:
print(14//5) #2
print(12//7) #1
print(56//17) #3

#2 **-->ორი გამრავლების ნიშანი(ხარისხში აჰყავს მოცემული რიცხვი) მაგ:
print(7**3) #343
print(2**5) #32
print(4**2) #16

#3 %-->პროცენტული გაყოფა,გვიბრუნებს ნაშთს როდესაც ერთ რიცხვს ვყოფთ მეორე რიცხვზე მაგ:
print(100%67) #33
print(50%45)  #5
print(90%78)  #12

#davaleba2
#კომენტარის სახით ახსენიტ თუ რითი განსხვავდებიან ერთმანეთისგან სიები და ცვლადები,და ასევე დაწერე თუ რაში ვიყენებთ სიებს
#ცვლადებში შეგვიძლია მხოლოდ ერთი ელემენტის შნახვა,სიებში კი შეგვიძლია შვინახოდ მრავალი ელემენტი

#დავალება3
#შექმენი სია რომელსაც შეინახავთ ცვლადში,ამ სიაში უნდა გქონდეს ყველა მონაცემთა ტიპის ელემენტი რომელიც ვისწავლეთ,სიის შექმნის შემდეგ დაპრინტეთ ეს სია
our_lists=["nika",15,50.67,False]
print(our_lists)
